```Acquiring state lock. This may take a few moments...
[0m[1mmodule.azure_rg.azurerm_resource_group.this: Refreshing state... [id=/subscriptions/f0efe35e-b5a6-42ef-9a7a-e11fa99a1f8f/resourceGroups/rg-cosmossample-demo][0m
[0m[1mmodule.cosmosdb.random_integer.ri: Refreshing state... [id=49623][0m
[0m
[1m[36mNote:[0m[1m Objects have changed outside of Terraform[0m

[0mTerraform detected the following changes made outside of Terraform since the
last "terraform apply":

[1m  # module.azure_rg.azurerm_resource_group.this[0m has been changed[0m[0m
[0m  [33m~[0m[0m resource "azurerm_resource_group" "this" {
        [1m[0mid[0m[0m       = "/subscriptions/f0efe35e-b5a6-42ef-9a7a-e11fa99a1f8f/resourceGroups/rg-cosmossample-demo"
        [1m[0mname[0m[0m     = "rg-cosmossample-demo"
      [32m+[0m [0m[1m[0mtags[0m[0m     = {}
        [90m# (1 unchanged attribute hidden)[0m[0m
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # module.cosmosdb.azurerm_cosmosdb_account.db[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_cosmosdb_account" "db" {
      [32m+[0m [0m[1m[0maccess_key_metadata_writes_enabled[0m[0m    = true
      [32m+[0m [0m[1m[0manalytical_storage_enabled[0m[0m            = false
      [32m+[0m [0m[1m[0mconnection_strings[0m[0m                    = (sensitive value)
      [32m+[0m [0m[1m[0mcreate_mode[0m[0m                           = (known after apply)
      [32m+[0m [0m[1m[0mdefault_identity_type[0m[0m                 = "FirstPartyIdentity"
      [32m+[0m [0m[1m[0menable_automatic_failover[0m[0m             = true
      [32m+[0m [0m[1m[0menable_free_tier[0m[0m                      = false
      [32m+[0m [0m[1m[0menable_multiple_write_locations[0m[0m       = false
      [32m+[0m [0m[1m[0mendpoint[0m[0m                              = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                                    = (known after apply)
      [32m+[0m [0m[1m[0mis_virtual_network_filter_enabled[0m[0m     = false
      [32m+[0m [0m[1m[0mkind[0m[0m                                  = "GlobalDocumentDB"
      [32m+[0m [0m[1m[0mlocal_authentication_disabled[0m[0m         = false
      [32m+[0m [0m[1m[0mlocation[0m[0m                              = "japaneast"
      [32m+[0m [0m[1m[0mmongo_server_version[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                                  = "sample-cosmos-db-49623"
      [32m+[0m [0m[1m[0mnetwork_acl_bypass_for_azure_services[0m[0m = false
      [32m+[0m [0m[1m[0moffer_type[0m[0m                            = "Standard"
      [32m+[0m [0m[1m[0mprimary_key[0m[0m                           = (sensitive value)
      [32m+[0m [0m[1m[0mprimary_master_key[0m[0m                    = (sensitive value)
      [32m+[0m [0m[1m[0mprimary_readonly_key[0m[0m                  = (sensitive value)
      [32m+[0m [0m[1m[0mprimary_readonly_master_key[0m[0m           = (sensitive value)
      [32m+[0m [0m[1m[0mpublic_network_access_enabled[0m[0m         = true
      [32m+[0m [0m[1m[0mread_endpoints[0m[0m                        = (known after apply)
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m                   = "rg-cosmossample-demo"
      [32m+[0m [0m[1m[0msecondary_key[0m[0m                         = (sensitive value)
      [32m+[0m [0m[1m[0msecondary_master_key[0m[0m                  = (sensitive value)
      [32m+[0m [0m[1m[0msecondary_readonly_key[0m[0m                = (sensitive value)
      [32m+[0m [0m[1m[0msecondary_readonly_master_key[0m[0m         = (sensitive value)
      [32m+[0m [0m[1m[0mwrite_endpoints[0m[0m                       = (known after apply)

      [32m+[0m [0manalytical_storage {
          [32m+[0m [0m[1m[0mschema_type[0m[0m = (known after apply)
        }

      [32m+[0m [0mbackup {
          [32m+[0m [0m[1m[0minterval_in_minutes[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mretention_in_hours[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0mstorage_redundancy[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0mtype[0m[0m                = (known after apply)
        }

      [32m+[0m [0mcapabilities {
          [32m+[0m [0m[1m[0mname[0m[0m = (known after apply)
        }

      [32m+[0m [0mcapacity {
          [32m+[0m [0m[1m[0mtotal_throughput_limit[0m[0m = (known after apply)
        }

      [32m+[0m [0mconsistency_policy {
          [32m+[0m [0m[1m[0mconsistency_level[0m[0m       = "Session"
          [32m+[0m [0m[1m[0mmax_interval_in_seconds[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mmax_staleness_prefix[0m[0m    = (known after apply)
        }

      [32m+[0m [0mgeo_location {
          [32m+[0m [0m[1m[0mfailover_priority[0m[0m = 0
          [32m+[0m [0m[1m[0mid[0m[0m                = (known after apply)
          [32m+[0m [0m[1m[0mlocation[0m[0m          = "japaneast"
          [32m+[0m [0m[1m[0mzone_redundant[0m[0m    = false
        }
      [32m+[0m [0mgeo_location {
          [32m+[0m [0m[1m[0mfailover_priority[0m[0m = 1
          [32m+[0m [0m[1m[0mid[0m[0m                = (known after apply)
          [32m+[0m [0m[1m[0mlocation[0m[0m          = "eastasia"
          [32m+[0m [0m[1m[0mzone_redundant[0m[0m    = false
        }
    }

[0m[1mPlan:[0m 1 to add, 0 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
```